import math


def area(r):
    '''
    Вычисляет площадь круга.

    Входные параметры:
    r (float): Радиус круга.

    Возвращает:
    float: Площадь круга.

    Пример вызова:
    >>>area()
    78.53981633974483
    '''
    return math.pi * r * r


def perimeter(r):
    '''
    Вычисляет периметр круга.

    Входные параметры:
    r (float): Радиус круга.

    Возвращает:
    float: Периметр круга.

    Пример вызова:
    >>>perimeter(5)
    31.41592653589793
    '''
    return 2 * math.pi * r

