def area(a, b): 
    '''
    Вычисляет площадь прямоугольника.

    Входные параметры:
    a (float): Длина прямоугольника.
    b (float): Ширина прямоугольника.

    Возвращает:
    float: Площадь прямоугольника.

    Пример вызова:
    >>>area(5, 10)
    50
    '''
    return a * b 

def perimeter(a, b): 
    '''
    Вычисляет периметр прямоугольника.

    Входные параметры:
    a (float): Длина прямоугольника.
    b (float): Ширина прямоугольника.

    Возвращает:
    float: Периметр прямоугольника.

    Пример вызова:
    >>>perimeter(5, 10)
    30
    '''
    return 2 * (a + b)
