def area(a, h): 
    '''
    Вычисляет площадь треугольника

    Входные параметры:
    a (float): Длина основания треугольника
    h (float): Высота треугольника

    Возвращает:
    float: Площадь треугольника

    Пример вызова:
    >>>area(5, 10)
    25
    '''
    return a * h / 2 

def perimeter(a, b, c): 
    '''
    Вычисляет периметр треугольника

    Входные параметры:
    a (float): Длина стороны треугольника
    b (float): Длина стороны треугольника
    c (float): Длина стороны треугольника

    Возвращает:
    float: Периметр треугольника

    Пример вызова:
    >>>perimeter(5, 10, 7)
    22
    '''
    return a + b + c 
